Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs.Document
The document associated with the event.
Since:
2010

Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
The base class used for pre events where the arguments must supply access to the document.
Since:
2010